; файл w.asm

;мои числа:
;X=(+/-) 1118
;y=(+/-) 1987
;var=18

;1118	+	20	=	1138
;-1118	+	20	=	-1098
;1118	+	(-20)	=	1098
;-1118	+	(-20)	=	-1138
;1987	+	20	=	2007
;-1987	+	20	=	-1967
;1987	+	(-20)	=	1967
;-1987	+	(-20)	=	-2007





title lab1-2
; ----------------------------------------------------------
; Приклад пограми на мові Асемблера для перевірки внутрішнього представлення даних
;-----------------------------------------------------------

.MODEL tiny ; цю директиву можна писати і БЕЗ крапки
		; Модель для цього прикладу НЕ МАЄ ЗНАЧЕННЯ
; можуть бути також ще моделі:
; small	  medium   compact   large   huge

.DATA ; писати БЕЗ крапки цю директиву НЕ МОЖНА!!!


;========== процесор і8086 ===================
; ---------- byte ----------
i 	db 	20
; ---------- word ---------
iw	dw 	1138
     	dw 	-1098
     	dw	1098
     	dw	-1138
     	dw	2007
     	dw	-1967
     	dw	1967
     	dw	-2007
	
; ---------- shortint ------
is 	db 	-20
; -------- integer --------
ii 	dw 	1138
     	dw 	-1098
     	dw	1098
     	dw	-1138
     	dw	2007
     	dw	-1967
     	dw	1967
     	dw	-2007
; --------- longint ---------
il 	dd 	1138
     	dd 	-1098
     	dd	1098
     	dd	-1138
     	dd	2007
     	dd	-1967
     	dd	1967
     	dd	-2007

iil 	dd 	1138
     	dd 	-1098
     	dd	1098
     	dd	-1138
     	dd	2007
     	dd	-1967
     	dd	1967
     	dd	-2007
END
